Autodesk.Navisworks.Api.Plugins.RenderPlugin
A plugin that can perform custom rendering.

Autodesk.Navisworks.Api.Plugins.RenderPlugin.#ctor
Default constructor for an RenderPlugin

Autodesk.Navisworks.Api.Plugins.RenderPlugin.MakeRenderBoundingBox(Autodesk.Navisworks.Api.View)
Should return bounding box of any additional model space geometry that will be rendered so that near/far clipping planes can be adjusted accordingly.
Returns:
Bounding box

Autodesk.Navisworks.Api.Plugins.RenderPlugin.OverlayRender(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.Graphics)
Override to allow custom drawing overlayed on main render.

Autodesk.Navisworks.Api.Plugins.RenderPlugin.Render(Autodesk.Navisworks.Api.View,Autodesk.Navisworks.Api.Graphics)
Override to allow custom drawing in main render.